export default {
  projections: {
    СотрудникE: {
      кодСотрудника: {
        __caption__: 'Код сотрудника'
      },
      имя: {
        __caption__: 'Имя'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      отчесвто: {
        __caption__: 'Отчесвто'
      },
      должность: {
        __caption__: 'Должность',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    },
    СотрудникL: {
      кодСотрудника: {
        __caption__: 'Код сотрудника'
      },
      имя: {
        __caption__: 'Имя'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      отчесвто: {
        __caption__: 'Отчесвто'
      },
      должность: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    }
  },
  validations: {
    имя: {
      __caption__: 'Имя'
    },
    кодСотрудника: {
      __caption__: 'Код сотрудника'
    },
    отчесвто: {
      __caption__: 'Отчесвто'
    },
    фамилия: {
      __caption__: 'Фамилия'
    },
    должность: {
      __caption__: 'Должность'
    }
  }
};
