export default {
  projections: {
    ДоступE: {
      кодДоступа: {
        __caption__: 'Код доступа'
      },
      доступ: {
        __caption__: 'Доступ'
      }
    },
    ДоступL: {
      кодДоступа: {
        __caption__: 'Код доступа'
      },
      доступ: {
        __caption__: 'Доступ'
      },
      комната: {
        __caption__: 'Код комнаты',
        кодКомнаты: {
          __caption__: 'Код комнаты'
        },
        колвоМест: {
          __caption__: 'колво мест'
        },
        стоимость: {
          __caption__: 'стоимость'
        },
        класс: {
          __caption__: 'Класс'
        }
      },
      сотрудник: {
        __caption__: 'Имя',
        имя: {
          __caption__: 'Имя'
        },
        фамилия: {
          __caption__: 'Фамилия'
        },
        отчесвто: {
          __caption__: 'Отчество'
        },
        должность: {
          __caption__: '',
          наименование: {
            __caption__: 'Наименование должности'
          }
        }
      }
    }
  },
  validations: {
    доступ: {
      __caption__: 'Доступ'
    },
    кодДоступа: {
      __caption__: 'Код доступа'
    },
    комната: {
      __caption__: 'Код комнаты'
    },
    сотрудник: {
      __caption__: 'Имя'
    },
    регистрЗаписи: {
      __caption__: 'регистрЗаписи'
    },
    гости: {
      __caption__: 'гости'
    }
  }
};
