export default {
  projections: {
    ГостиE: {
      кодГостя: {
        __caption__: 'Код гостя'
      },
      имя: {
        __caption__: 'Имя'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      отчество: {
        __caption__: 'Отчество'
      },
      сотовый: {
        __caption__: 'Сотовый'
      },
      комментарий: {
        __caption__: 'Комментарий'
      }
    }
  },
  validations: {
    имя: {
      __caption__: 'Имя'
    },
    кодГостя: {
      __caption__: 'Код гостя'
    },
    комментарий: {
      __caption__: 'Комментарий'
    },
    отчество: {
      __caption__: 'Отчество'
    },
    сотовый: {
      __caption__: 'Сотовый'
    },
    фамилия: {
      __caption__: 'Фамилия'
    },
    доступ: {
      __caption__: 'доступ'
    }
  }
};
